{"upload_date": "20100303", "playlist": null, "description": "From Giallozafferano, the italian most famous food website, a new video recipe: pizza margherita. Find this and many more recipes with pictures on the Giallozafferano App (in English) http://itunes.apple.com/app/giallozaf...\n\n***\n\nWelcome! I'm Sonia and we're in the GialloZafferano kitchen to prepare a pizza margherita. Pizza margherita is among the simplest and most usual of Italian pizzas, invented at the end of the 1800s by Raffaele Sposito -- a pizza maker of that time who created the dish for Queen Margherita. Let's see the ingredients we'll need:\n• Pizza dough made with 8 cups (1 kg) of flour from the recipe on GialloZafferano. This will make 4 pizzas\n• About 3 and a half cups (700 g) of a hearty tomato puree\n• 1 and a quarter pounds (600 g) of mozzarella cheese\n• 12 basil leaves\n• Extra virgin olive oil\n• Salt\n• A round pan 12\" (30 cm) diameter\nLet's begin making our pizza margherita.\nFirstly, cut the mozzarella into cubes. Now let's season the puree. We need a dense sauce, so if your puree is too watery, let it stand in a cloth lined colander over a bowl and let some of the water drain out into the bottom. First add a bit of olive oil, a good pinch of salt, and stir it together.\nSpread a bit of oil over the pan so that it's entirely covered. After this, take about a quarter of your pizza dough, form a ball so you can flatten it easily into a disc, and begin to spread it out evenly on the bottom of the pan.\nNow that the dough is well spread out, it's time for the sauce. Add a couple of spoonfuls, or more depending on your taste, and after add the mozzarella. If you'd like, you can add another turn of olive oil to the top. Our pizza is ready to be baked for about 15 to 20 minutes in at 480 degrees F.\nOur beautiful pizza margherita is ready. The finishing touch is to lay a few basil leaves right in the centre of the pie. And that's it! Another very simple variation is to add a few anchovy fillets to make a pizza napoletana. From Sonia and GialloZafferano, bye and see you in the next videorecipe!", "format": "22 - 720x1280", "url": "http://r18---sn-nwj7knek.c.youtube.com/videoplayback?id=1be4e656d535171f&newshard=yes&cp=U0hVTlFNU19HS0NONV9JR1dKOnJGbDh2b2s3WnE5&key=yt1&ratebypass=yes&source=youtube&fexp=913814%2C910207%2C929203%2C916613%2C929306%2C924605%2C901208%2C929123%2C929915%2C929906%2C925714%2C929119%2C931202%2C932802%2C928017%2C912518%2C911416%2C906906%2C904476%2C930807%2C919373%2C906836%2C933701%2C900345%2C912711%2C929606%2C910075%2C906098&expire=1369125921&sver=3&mv=m&ip=2600%3A3c01%3A%3Af03c%3A91ff%3Afedf%3A2d11&mt=1369101805&itag=22&upn=AQ-5H1Q8ubY&ms=au&sparams=cp%2Cid%2Cip%2Cipbits%2Citag%2Cratebypass%2Csource%2Cupn%2Cexpire&ipbits=48&signature=55C0ED0A104B114E709CD3BA643C36B3ABD3EDE6.72A8F55BDFC2D3FB255A458793DA414A281DE599", "title": "Pizza margherita - Italian recipe", "id": "G-TmVtU1Fx8", "thumbnail": "https://i4.ytimg.com/vi/G-TmVtU1Fx8/default.jpg", "ext": "mp4", "stitle": "Pizza margherita - Italian recipe", "extractor": "youtube", "uploader": "yellowsaffron", "duration": "204", "fulltitle": "Pizza margherita - Italian recipe", "player_url": null, "uploader_id": "yellowsaffron", "subtitles": null, "playlist_index": null}